//Task 1
let q = prompt("Укажите вашу облать в цифре: ( 01 - Чуйская ; 02 - Иссык-кульска; 03 - Нарынская; 04 - Таласская; 05 - Ошская; 06 - Джалал-Абадская; 07 - Баткенская; 11 - Автомобили на временном учёте)" )
let regions = {
    "01" : "Чуйская область",
    "02" : "Иссык-кульска область",
    "03" : "Нарынска область",
    "04" : "Таласская область",
    "05" : "Ошская область",
    "06" : "Джалал-Абадская область",
    "07" : "Баткенская область",
    "11" : "Автомобиль на временном учете"
};
if (regions[q]){
    console.log(regions[q]);
} else {
    console.log("Такого номера не существует");
}




//Task 2
let som = prompt("Укажите сумму обмена:")
let v = prompt("Укажите валюту: (USD - доллары; EUR - евро; RUB - рубли)")
let varets = {
    "USD" : 88,
    "EUR" : 98,
    "RUB" : 0.9
}
if (varets[v]){
    let result = Math.round(som/varets[v])
    console.log("Ваша сумма: " + som)
    console.log("Курс " + varets[v] + "сом")
    console.log("Сумма после обмена: " + result + "" + v)
} else {
    console.log("Такой валюты нет в списке возможных")
}
